<?php defined('BASEPATH') OR exit('No direct script access allowed'); ?>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

    <title>Main Системa учёта картриджей</title>

    <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js"></script>

    <link rel='stylesheet' href="<?php echo base_url(); ?>assets/css/bootstrap.min.css" type='text/css' media='all' />
    <!--<link rel="stylesheet" href="<?php /*echo base_url(); */?>assets/css/mystyle.css" type="text/css">-->
</head>


<body>
<div class="container">
    <dl class="dl-horizontal">
        В информатике термин инструкция обозначает одну отдельную операцию процессора, определённую системой команд. В более широком понимании, «инструкцией» может быть любое представление элемента исполнимой программы, такой как байт-код.
        В традиционных архитектурах инструкция включает код операции, определяющий выполнение этой операции, как например, «добавить содержимое памяти в регистр», ноль или больше определений операндов, которые могут описывать регистры, расположение в памяти или символьные данные. Определения операндов могут содержать методы адресации, указывающие их значение, или находится в фиксированных полях.
        В архитектуре VLIW (very long instruction word — очень длинная машинная команда), которая может включать в себя микрокоды, множество одновременно исполняемых операций и операнды определяются в одной инструкции.
        Размер или длина инструкции может изменяться в довольно широких пределах, от маленьких, размером в 4 бита в некоторых микроконтроллерах, и до инструкций размером в многие сотни бит, как в некоторых VLIW системах. Большинство современных процессоров, используемых в персональных компьютерах, мейнфреймах и суперкомпьютерах, имеют инструкции размером от 16 до 64 бит. В некоторых архитектурах, в основном типа RISC, инструкции имеют фиксированную длину, обычно сравнимую с размером машинного слова этой архитектуры. В остальных архитектурах, инструкции имеют переменную длину, обычно целое множество байт или полуслов.
        Инструкции, составляющие программу, редко определяются при помощи их внутренней числовой формы; они могут определяться программистами с помощью языка ассемблера или, в более общем виде, могут генерироваться компиляторами.
    </dl>
</div>